@echo off

rem ===========================================================================
rem ディレクトリ定義
rem ---------------------------------------------------------------------------
set TEST_PATH=D:\TEST
set LOGFILE=%TEST_PATH%\%date:~0,4%%date:~5,2%%date:~8,2%.LOG

rem ===========================================================================
rem Batch Start 処理
rem ---------------------------------------------------------------------------

rem 空白行をログファイルに出力
echo.  >> %LOGFILE%

rem 開始ログをログファイルに出力
echo ****** 処理開始 %date% %time% ****** >> %LOGFILE%

rem 空白行をログファイルに出力
echo.  >> %LOGFILE%

rem 移行処理開始、VBSを呼び出し、実行結果をログファイルに出力
CScript %TEST_PATH%\TEST.VBS >> %LOGFILE%

rem 空白行をログファイルに出力
echo.  >> %LOGFILE%

rem 終了ログをログファイルに出力
echo ****** 処理終了 %date% %time% ****** >> %LOGFILE%
